In [74]:
import pandas as pd
import numpy as np
import datetime

In [221]:
cus = pd.read_csv("Customers.csv")

In [222]:
cus.head()

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,07-03-1939
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,9/27/1979
2,554,Female,Claire Ferres,WINJALLOK,VIC,Victoria,3380,Australia,Australia,5/26/1947
3,786,Male,Jai Poltpalingada,MIDDLE RIVER,SA,South Australia,5223,Australia,Australia,9/17/1957
4,1042,Male,Aidan Pankhurst,TAWONGA SOUTH,VIC,Victoria,3698,Australia,Australia,11/19/1965

In [223]:
cus["Birthday"]= cus["Birthday"].str.replace("/","-")
cus["Birthday"]= pd.to_datetime(cus["Birthday"],format = "%m-%d-%Y")

In [224]:
cus.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15266 entries, 0 to 15265
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   CustomerKey  15266 non-null  int64
 1   Gender       15266 non-null  object
 2   Name         15266 non-null  object
 3   City         15266 non-null  object
 4   State Code   15256 non-null  object
 5   State        15266 non-null  object
 6   Zip Code     15266 non-null  object
 7   Country      15266 non-null  object
 8   Continent    15266 non-null  object
 9   Birthday     15266 non-null  datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(8)
memory usage: 1.2+ MB

In [87]:
exch = pd.read_csv("Exchange_Rates.csv")

In [88]:
exch.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11215 entries, 0 to 11214
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      11215 non-null  object
 1   Currency  11215 non-null  object
 2   Exchange  11215 non-null  float64
dtypes: float64(1), object(2)
memory usage: 263.0+ KB

In [91]:
exch

            Date Currency  Exchange
0     2015-01-01      USD    1.0000
1     2015-01-01      CAD    1.1583
2     2015-01-01      AUD    1.2214
3     2015-01-01      EUR    0.8237
4     2015-01-01      GBP    0.6415
...          ...      ...       ...
11210 2021-02-20      USD    1.0000
11211 2021-02-20      CAD    1.2610
11212 2021-02-20      AUD    1.2723
11213 2021-02-20      EUR    0.8238
11214 2021-02-20      GBP    0.7126

[11215 rows x 3 columns]

In [90]:
exch["Date"]= exch["Date"].str.replace("/","-")
Unit Price USD

In [99]:
pro = pd.read_csv("Products.csv")

In [103]:
pro

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,6.62,12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,6.62,12.99,101,MP4&MP3,1,Audio
2,3,Contoso 1G MP3 Player E100 White,Contoso,White,7.40,14.52,101,MP4&MP3,1,Audio
3,4,Contoso 2G MP3 Player E200 Silver,Contoso,Silver,11.00,21.57,101,MP4&MP3,1,Audio
4,5,Contoso 2G MP3 Player E200 Red,Contoso,Red,11.00,21.57,101,MP4&MP3,1,Audio
...,...,...,...,...,...,...,...,...,...,...
2512,2513,Contoso Bluetooth Active Headphones L15 Red,Contoso,Red,43.07,129.99,505,Cell phones Accessories,5,Cell phones
2513,2514,Contoso Bluetooth Active Headphones L15 White,Contoso,White,43.07,129.99,505,Cell phones Accessories,5,Cell phones
2514,2515,Contoso In-Line Coupler E180 White,Contoso,White,1.71,3.35,505,Cell phones Accessories,5,Cell phones
2515,2516,Contoso In-Line Coupler E180 Black,Contoso,Black,1.71,3.35,505,Cell phones Accessories,5,Cell phones
2516,2517,Contoso In-Line Coupler E180 Silver,Contoso,Silver,1.71,3.35,505,Cell phones Accessories,5,Cell phones

In [101]:
pro["Unit Cost USD"]= pro["Unit Cost USD"].str.replace("[$/,]","",regex=True)
pro["Unit Price USD"]= pro["Unit Price USD"].str.replace("[$/,]","",regex=True)

pro["Unit Cost USD"]= pro["Unit Cost USD"].apply(lambda i : float(i))
pro["Unit Price USD"]= pro["Unit Price USD"].apply(lambda i : float(i))

In [102]:
pro.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2517 entries, 0 to 2516
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ProductKey      2517 non-null   int64
 1   Product Name    2517 non-null   object
 2   Brand           2517 non-null   object
 3   Color           2517 non-null   object
 4   Unit Cost USD   2517 non-null   float64
 5   Unit Price USD  2517 non-null   float64
 6   SubcategoryKey  2517 non-null   int64
 7   Subcategory     2517 non-null   object
 8   CategoryKey     2517 non-null   int64
 9   Category        2517 non-null   object
dtypes: float64(2), int64(3), object(5)
memory usage: 196.8+ KB

In [143]:
sale = pd.read_csv("Sales.csv")

In [144]:
sale

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code,Unnamed: 9
0,366000,1,01-01-2016,NaN,265598,10,1304,1,CAD,NaN
1,366001,1,01-01-2016,1/13/2016,1269051,0,1048,2,USD,NaN
2,366001,2,01-01-2016,1/13/2016,1269051,0,2007,1,USD,NaN
3,366002,1,01-01-2016,01-12-2016,266019,0,1106,7,CAD,NaN
4,366002,2,01-01-2016,01-12-2016,266019,0,373,1,CAD,NaN
...,...,...,...,...,...,...,...,...,...,...
62879,2243030,1,2/20/2021,NaN,1216913,43,632,3,USD,NaN
62880,2243031,1,2/20/2021,2/24/2021,511229,0,98,4,EUR,NaN
62881,2243032,1,2/20/2021,2/23/2021,331277,0,1613,2,CAD,NaN
62882,2243032,2,2/20/2021,2/23/2021,331277,0,1717,2,CAD,NaN
62883,2243032,3,2/20/2021,2/23/2021,331277,0,464,7,CAD,NaN

In [145]:
sale.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62884 entries, 0 to 62883
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order Number   62884 non-null  int64
 1   Line Item      62884 non-null  int64
 2   Order Date     62884 non-null  object
 3   Delivery Date  13165 non-null  object
 4   CustomerKey    62884 non-null  int64
 5   StoreKey       62884 non-null  int64
 6   ProductKey     62884 non-null  int64
 7   Quantity       62884 non-null  int64
 8   Currency Code  62884 non-null  object
 9   Unnamed: 9     1 non-null      object
dtypes: int64(6), object(4)
memory usage: 4.8+ MB

In [146]:
sale["Order Date"]= sale["Order Date"].str.replace("/","-")
sale["Delivery Date"] = sale["Delivery Date"].str.replace("/", "-")

sale["Order Date"]= pd.to_datetime(sale["Order Date"],format = "%m-%d-%Y")
sale["Delivery Date"]= pd.to_datetime(sale["Delivery Date"],format = "%m-%d-%Y")

In [147]:
sale = sale.drop(columns="Unnamed: 9")

In [148]:
sto = pd.read_csv("Stores.csv")

In [149]:
sto

,StoreKey,Country,State,Square Meters,Open Date
0,1,Australia,Australian Capital Territory,595.0,01-01-2008
1,2,Australia,Northern Territory,665.0,01-12-2008
2,3,Australia,South Australia,2000.0,01-07-2012
3,4,Australia,Tasmania,2000.0,01-01-2010
4,5,Australia,Victoria,2000.0,12-09-2015
...,...,...,...,...,...
62,63,United States,Utah,2000.0,03-06-2008
63,64,United States,Washington DC,1330.0,01-01-2010
64,65,United States,West Virginia,1785.0,01-01-2012
65,66,United States,Wyoming,840.0,01-01-2014
66,0,Online,Online,NaN,01-01-2010

In [150]:
sto.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67 entries, 0 to 66
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   StoreKey       67 non-null     int64
 1   Country        67 non-null     object
 2   State          67 non-null     object
 3   Square Meters  66 non-null     float64
 4   Open Date      67 non-null     object
dtypes: float64(1), int64(1), object(3)
memory usage: 2.7+ KB

In [157]:
sale.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62884 entries, 0 to 62883
Data columns (total 21 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Order Number    62884 non-null  int64
 1   Line Item       62884 non-null  int64
 2   Order Date      62884 non-null  datetime64[ns]
 3   Delivery Date   13165 non-null  datetime64[ns]
 4   CustomerKey     62884 non-null  int64
 5   StoreKey        62884 non-null  int64
 6   ProductKey      62884 non-null  int64
 7   Quantity        62884 non-null  int64
 8   Currency Code   62884 non-null  object
 9   Date            62884 non-null  datetime64[ns]
 10  Currency        62884 non-null  object
 11  Exchange        62884 non-null  float64
 12  Product Name    62884 non-null  object
 13  Brand           62884 non-null  object
 14  Color           62884 non-null  object
 15  Unit Cost USD   62884 non-null  float64
 16  Unit Price USD  62884 non-null  float64
 17  SubcategoryKey  62884 non-null  int64
 18  Subcategory     62884 non-null  object
 19  CategoryKey     62884 non-null  int64
 20  Category        62884 non-null  object
dtypes: datetime64[ns](3), float64(3), int64(8), object(7)
memory usage: 10.1+ MB

In [159]:
sale

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code,Date,...,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category,value
0,366000,1,2016-01-01,NaT,265598,10,1304,1,CAD,2016-01-01,...,Contoso Lens Adapter M450 White,Contoso,White,31.27,68.00,406,Cameras & Camcorders Accessories,4,Cameras and camcorders,94.41120
1,366001,1,2016-01-01,2016-01-13,1269051,0,1048,2,USD,2016-01-01,...,A. Datum SLR Camera X136 Silver,A. Datum,Silver,141.47,427.00,402,Digital SLR Cameras,4,Cameras and camcorders,854.00000
2,366001,2,2016-01-01,2016-01-13,1269051,0,2007,1,USD,2016-01-01,...,Fabrikam Microwave 1.5CuFt X1100 Black,Fabrikam,Black,220.64,665.94,803,Microwaves,8,Home Appliances,665.94000
3,366002,1,2016-01-01,2016-01-12,266019,0,1106,7,CAD,2016-01-01,...,Contoso SLR Camera M146 Orange,Contoso,Orange,148.08,322.00,402,Digital SLR Cameras,4,Cameras and camcorders,3129.45360
4,366002,2,2016-01-01,2016-01-12,266019,0,373,1,CAD,2016-01-01,...,Adventure Works Laptop8.9 E0890 White,Adventure Works,White,166.20,326.00,301,Laptops,3,Computers,452.61840
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
62879,2243030,1,2021-02-20,NaT,1216913,43,632,3,USD,2021-02-20,...,WWI Screen 85in E1010 White,Wide World Importers,White,70.87,139.00,305,Projectors & Screens,3,Computers,417.00000
62880,2243031,1,2021-02-20,2021-02-24,511229,0,98,4,EUR,2021-02-20,...,WWI Wireless Bluetooth Stereo Headphones M170 ...,Wide World Importers,Silver,55.18,120.00,106,Bluetooth Headphones,1,Audio,395.42400
62881,2243032,1,2021-02-20,2021-02-23,331277,0,1613,2,CAD,2021-02-20,...,SV DVD 7-Inch Player Portable E200 White,Southridge Video,White,56.08,109.99,602,Movie DVD,6,"Music, Movies and Audio Books",277.39478
62882,2243032,2,2021-02-20,2021-02-23,331277,0,1717,2,CAD,2021-02-20,...,MGS Flight Simulator X M250,Tailspin Toys,Pink,32.25,70.13,702,Download Games,7,Games and Toys,176.86786
62883,2243032,3,2021-02-20,2021-02-23,331277,0,464,7,CAD,2021-02-20,...,Proseware LCD22W M2001 Black,Proseware,Black,224.97,679.00,304,Monitors,3,Computers,5993.53300

In [128]:
sto["Open Date"] = sto["Open Date"].str.replace("/", "-")
sto["Open Date"]= pd.to_datetime(sto["Open Date"],format = "%m-%d-%Y")

In [153]:
sale =pd.merge(sale, exch, left_on=['Order Date', 'Currency Code'], right_on=['Date', 'Currency'], how='left')

In [155]:
sale =pd.merge(sale, pro, left_on=['ProductKey'], right_on=['ProductKey'], how='left')

In [206]:
stage1 = sale.groupby(["CustomerKey", "Order Number"])["value"].sum().reset_index(name='Values')

In [207]:
stage1

       CustomerKey  Order Number       Values
0              301       1776007   863.550400
1              325       1109001  5037.613200
2              325       1781006  1357.931370
3              325       1830002  1291.370657
4              554       1100024   455.639100
...            ...           ...          ...
26321      2099758       1704045    40.970000
26322      2099758       1988011   488.940000
26323      2099862       1827080   501.500000
26324      2099937       1269016  5575.000000
26325      2099937       1872055  6200.390000

[26326 rows x 3 columns]

In [181]:
stage1.to_csv("stage1.csv")

In [209]:
stage2 = stage1.groupby("CustomerKey")["Values"].sum().reset_index(name='Values')

In [210]:
stage2

       CustomerKey        Values
0              301    863.550400
1              325   7686.915227
2              554   1326.770308
3             1042   1435.722633
4             1314   3309.691566
...            ...           ...
11882      2099383   3739.000000
11883      2099600   1270.840000
11884      2099758    529.910000
11885      2099862    501.500000
11886      2099937  11775.390000

[11887 rows x 2 columns]

In [220]:
cus

,CustomerKey_x,Values,CustomerKey_y,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday
0,301,863.550400,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaT
1,325,7686.915227,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaT
2,554,1326.770308,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaT
3,1042,1435.722633,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaT
4,1314,3309.691566,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaT
...,...,...,...,...,...,...,...,...,...,...,...,...
11882,2099383,3739.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaT
11883,2099600,1270.840000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaT
11884,2099758,529.910000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaT
11885,2099862,501.500000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaT
11886,2099937,11775.390000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaT

In [229]:
stage3 = stage1.groupby("CustomerKey")["Order Number"].count().reset_index(name='frequency')

In [230]:
stage3

       CustomerKey  frequency
0              301          1
1              325          3
2              554          2
3             1042          1
4             1314          1
...            ...        ...
11882      2099383          3
11883      2099600          1
11884      2099758          2
11885      2099862          1
11886      2099937          2

[11887 rows x 2 columns]

In [158]:
sale["value"] = sale["Quantity"]*sale["Exchange"]*sale["Unit Price USD"]

In [213]:
stage2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11887 entries, 0 to 11886
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   CustomerKey  11887 non-null  int64
 1   Values       11887 non-null  float64
dtypes: float64(1), int64(1)
memory usage: 185.9 KB

In [225]:
cus = pd.merge(cus, stage2, on="CustomerKey", how="left")

In [231]:
cus = pd.merge(cus, stage3, on="CustomerKey", how="left")

In [232]:
cus

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday,Values,frequency
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,1939-07-03,863.550400,1.0
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,1979-09-27,7686.915227,3.0
2,554,Female,Claire Ferres,WINJALLOK,VIC,Victoria,3380,Australia,Australia,1947-05-26,1326.770308,2.0
3,786,Male,Jai Poltpalingada,MIDDLE RIVER,SA,South Australia,5223,Australia,Australia,1957-09-17,NaN,NaN
4,1042,Male,Aidan Pankhurst,TAWONGA SOUTH,VIC,Victoria,3698,Australia,Australia,1965-11-19,1435.722633,1.0
...,...,...,...,...,...,...,...,...,...,...,...,...
15261,2099600,Female,Denisa Dušková,Houston,TX,Texas,77017,United States,North America,1936-03-25,1270.840000,1.0
15262,2099618,Male,Justin Solórzano,Mclean,VA,Virginia,22101,United States,North America,1992-02-16,NaN,NaN
15263,2099758,Male,Svend Petrussen,Wilmington,NC,North Carolina,28405,United States,North America,1937-11-09,529.910000,2.0
15264,2099862,Female,Lorenza Rush,Riverside,CA,California,92501,United States,North America,1937-10-12,501.500000,1.0
15265,2099937,Male,Zygmunt Kaminski,Bloomfield Township,MI,Michigan,48302,United States,North America,1965-08-18,11775.390000,2.0